#include <stdio.h>
/*在整数100以内找出符合条件的数字能被3整出，而且有一位数是5的数字采用的算法*/
int main()
{
    int n[100];    /*声明数组a100个数字*/
    int i;          /*声明i是选出的数字*/
    int a1;         /*声明选出的数字的个位数*/
    int a2;         /*声明选出的数字的十位数*/
    int j=0;        /*声明代表符合条件的数字个数*/
    /*开始遍历数字*/
    for(i=0;i<=100;i++)
    {
        a1=i %10;       /*声明数字的个位数*/
        a2=i /10;       /*声明数字的十位数*/
        if(i %3 && (a1 ==5 || a2 ==5))
        {
            n[j]=i;    /*符合条件的i全部装入符合条件的数组*/
            j++;       /*i自增*/

        }
    } 
 printf("符合条件的数字有%d个\n",j);
 for(i=0;i<=j;i++)
 {
printf("%d\n",n[i]);
 }
}